Revit 2027 API
UIMacroManager.GetMacroManager Method
 Gets the UI Macro manager from the UI application.
Namespace: Autodesk.Revit.UI.Macros
Assembly: RevitAPIUIMacros (in RevitAPIUIMacros.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static UIMacroManager GetMacroManager(
	UIApplication application
)
Public Shared Function GetMacroManager (
	application As UIApplication
) As UIMacroManager
public:
static UIMacroManager^ GetMacroManager(
	UIApplication^ application
)
static member GetMacroManager :
        application : UIApplication -> UIMacroManager
Parameters
application UIApplication
 The UI application.
Return Value
UIMacroManager
 The new UI Macro manager object.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was NULL
See Also
Reference
UIMacroManager Class
Autodesk.Revit.UI.Macros Namespace